# 作者: 大数据 浪哥
# 2025年06月12日04时52分28秒
# 1054074422@qq.com
##########################################
# 1. 定义年龄变量
age = 18
# 2. 判断是否满 18 岁
# if 语句以及缩进部分的代码是一个完整的代码块
if age >= 18:
    print("可以进网吧嗨皮……")
# 3. 思考！- 无论条件是否满足都会执行
print("这句代码什么时候执行?")
print('-'*50)
##########################################
# 1. 输入用户年龄
age = int(input("今年多大了？"))
# 2. 判断是否满 18 岁
# if 语句以及缩进部分的代码是一个完整的语法块
if age >= 18:
    print("可以进网吧嗨皮……")
else:
    print("你还没长大，应该回家写作业！")
# 3. 思考！- 无论条件是否满足都会执行
print("这句代码什么时候执行?")
print('-'*50)
##########################################
